[
  {
    "slug": "why-practicing-conversations-works",
    "title": "Why Practicing Conversations in Your Head Actually Works",
    "summary": "How simulated dialogues can train your brain for calmer, clearer real-life interactions.",
    "published_at": "2025-01-10",
    "content": "When you rehearse a conversation, your brain activates many of the same networks it would use in the real interaction. \nMicro-scenarios use this effect on purpose: you mentally step into a moment, explore different reactions, and feel the emotional impact—all without the real-world risk.\n\nThat means that when a similar situation appears in your actual life, it no longer feels completely new.\nYou've already visited it in your mind, tested a few responses, and seen what tends to work better."
  },
  {
    "slug": "how-to-use-micro-scenarios-daily",
    "title": "How to Use Micro-Scenarios as a Daily 5-Minute Habit",
    "summary": "You don't need an hour of training. Here’s how to build skill with just one scenario a day.",
    "published_at": "2025-01-15",
    "content": "A simple routine: pick one scenario, read it once, choose your instinctive answer, and then read the alternatives.\nNotice how each choice would likely feel in your body: lighter, heavier, tense, relieved.\n\nThis kind of micro-reflection builds a mental library of responses.\nOver time, you start reaching for more grounded, skillful reactions automatically."
  },
  {
    "slug": "designing-safer-conversations",
    "title": "Designing Safer Conversations When the Stakes Feel High",
    "summary": "Why structure, timing, and language choices matter when the topic is sensitive.",
    "published_at": "2025-01-20",
    "content": "High-stakes conversations feel dangerous because a lot is riding on how they go.\nOne way to make them safer is to design them: choose a calm time, start with impact rather than blame, and pause often to check in.\n\nMicro-scenarios let you rehearse these design decisions ahead of time so you’re not improvising everything in the heat of the moment."
  }
]